/******************************************************************************
 *	ソフトウェアライブラリ
 *
 *	Copyright (c) 1994 SEGA
 *
 * Library:ファイルシステム
 * Module :CDバッファモジュールヘッダ
 * File	  :gfs_cdb.h
 * Date   :1994-11-11
 * Version:1.16
 * Auther :M.S.
 *
 *************************************************************************** */

#if !defined(GFS_CDB_H)
/*****************************************************************************
 *	インクルードファイル
 *****************************************************************************/

/*****************************************************************************
 *	定数マクロ
 *****************************************************************************/
#define GFS_CDB_H

/*****************************************************************************
 *	列挙定数
 *****************************************************************************/

/*****************************************************************************
 *	処理マクロ
 *****************************************************************************/

/*****************************************************************************
 *	データ型の定義
 *****************************************************************************/

/*****************************************************************************
 *	変数の宣言
 *****************************************************************************/

/*****************************************************************************
 *	関数の宣言
 *****************************************************************************/

/*  CDバッファ資源管理構造体の初期化 */
Bool GFCB_Setup(GfsFlow *flow);

/* 使用資源の解放 */
void GFCB_Close(GfsDtsrc *dts);

/* 取り出しモードの設定 */
Sint32 GFCB_SetGmode(GfsDtsrc *dts, Sint32 gmode);

/* ＣＤバッファの有効セクタ数取得 */
Sint32 GFCB_GetLenData(GfsFlow *flow, Sint32 usct, Sint32 *asiz);

/* リード絞りの設定 */
void GFCB_SetFilt(GfsDtsrc *dts, Sint32 fmode, CdcSubh *subh);

/*  ＣＤバッファ全消去	*/
Sint32 GFCB_DeleteAllData(GfsDtsrc *dts);

/*  アクセスポインタ取得 */
Sint32 GFCB_Tell(GfsDtsrc *dts);

/*  アクセスポインタ設定 */
Sint32 GFCB_Seek(GfsFlow *flow, Sint32 off, Sint32 org);

/*  転送元データパックパラメータ設定	*/
GfdpHn GFCB_GetSrcPack(GfsFlow *flow, Sint32 nsct);

/* 転送元データパックの準備 */
GfdpHn GFCB_ReadySrcPack(GfsFlow *flow, Sint32 nsct);

/* データパックを取得した後のデータ要求 */
Bool GFCB_GetSctData(GfdpHn dpk, GfsDtsrc *dts);

/*  転送先データパックパラメータ設定	*/
GfdpHn GFCB_GetDstPack(GfsDtsrc *dts, Sint32 len);

/*  データパック返還	*/
void GFCB_RtnPk(GfsFlow *flow, GfdpHn dpk, Sint32 nsct);

/* ピックアップの移動 */
Sint32 GFCB_MovePickup(GfsDtsrc *dts, CdcPos *pos);

/* CDデバイス接続 */
Bool GFCB_SetCon(GfsDtsrc *dts);

/* ピックアップの制御権を確保する */
Bool GFCB_GetPickup(GfsDtsrc *dts);

/* ピックアップを確保しているか調べる */
Bool GFCB_IsPuOwner(GfsDtsrc *dts);

/* ピックアップを解放する */
void GFCB_UngetPickup(GfsDtsrc *dts);


#endif      /* GFS_CDB_H    */

/* end of file */
