/******************************************************************************
 *	ソフトウェアライブラリ
 *
 *	Copyright (c) 1994 SEGA
 *
 * Library:ファイルシステム
 * Module :ディレクトリ操作モジュールヘッダ
 * File	  :gfs_dir.h
 * Date   :1994-11-11
 * Version:1.16
 * Auther :M.S.
 *
 *****************************************************************************/

#if !defined(GFS_DIR_H)
#define     GFS_DIR_H

/*****************************************************************************
 *	インクルードファイル
 *****************************************************************************/

/*****************************************************************************
 *	定数マクロ
 *****************************************************************************/
/* 属性 */
#define GFS_ATR_FTYPE_MASK	0x06	/* ファイル種別取得マスク */
#define GFS_ATR_CD_FILE		0x00	/* CD上のファイル */
#define GFS_ATR_MEM_FILE	0x04	/* メモリファイル */
#define GFS_ATR_SCSI_FILE	0x02	/* SCSI上のファイル */

/*****************************************************************************
 *	列挙定数
 *****************************************************************************/

/*****************************************************************************
 *	処理マクロ
 *****************************************************************************/

/* CDファイルの判定 */
#define IS_CDFILE(atr)	\
    ((((atr) & GFS_ATR_FTYPE_MASK) == GFS_ATR_CD_FILE)? TRUE: FALSE)

/* メモリファイルの判定 */
#define IS_MEMFILE(atr)    \
    ((((atr) & GFS_ATR_FTYPE_MASK) == GFS_ATR_MEM_FILE)? TRUE: FALSE)

/* SCSIファイルの判定 */
#define IS_SCSIFILE(atr)	\
    ((((atr) & GFS_ATR_FTYPE_MASK) == GFS_ATR_SCSI_FILE)? TRUE: FALSE)


/*****************************************************************************
 *	データ型の定義
 *****************************************************************************/

/*****************************************************************************
 *	変数の宣言
 *****************************************************************************/

/*****************************************************************************
 *	関数の宣言
 *****************************************************************************/

/* ディレクトリテーブル読み込み */
Sint32 GFDR_SetupDirTbl(GfsHn gfs, GfsDirTbl *dirtbl, Sint32 nsct);

/* ファイル名からファイル識別子を取得する */
Sint32 GFDR_NameToId(GfsDirName *rectbl, Sint8 *fname, Sint32 max);

/* ディレクトリレコードテーブルの情報を取得する */
GfsDirId *GFDR_GetInfoDirId(Sint32 fid, GfsDirId *rectbl);

/* ディレクトリレコードテーブルの情報を取得する */
GfsDirName *GFDR_GetInfoDirName(Sint32 fid, GfsDirName *rectbl);

/* ファイルの属性取得 */
Sint32 GFDR_GetAtrDirId(Sint32 fid, GfsDirId *rectbl);

/* ファイル名取得 */
Sint32 GFDR_GetAtrDirName(Sint32 fid, GfsDirName *rectbl);

/* CDBFSでルートディレクトリに移動 */
Sint32 GFDR_ChgRoot(void);

/* CDBFSでカレントディレクトリ変更 */
Sint32 GFDR_ChgDir(Sint32 fid);

#endif /* !defined(GFS_DIR_H) */

/* end of file */
