/*	Copyright(c) 1994 SEGA			*/
/*--------------------------------------------------------------------------
 * アクション管理
 *--------------------------------------------------------------------------
 * アクションはゲームのキャラクタなどで一度に多くのプログラムを動かせたい
 * ときに使います。
 *--------------------------------------------------------------------------
 */


#include "smp_bios.h"



ACTWK SMTA_ActionBuf[ACTWKMAX];
ACTWK SMTA_DummyActwk;


/*--------------------------------------------------------------
 *  アクションワークの初期化
 *--------------------------------------------------------------
 *  配列の必要最小限の内容しかクリアしません
 *  
 *  
 *--------------------------------------------------------------
 */
void SMTA_ActWkInit(void)
{
    ACTWK *ix;
    Uint16 i;

    ix = &SMTA_ActionBuf[0];
    for (i = 0; i < ACTWKMAX; i++) {
        ix->actid = 0;
        ix->pcbuff = NULL;
        ix->mode = 0;
        ix->status = 0;
        ix->level = 0;
        ix++;
     }
   
}




/*--------------------------------------------------------------
 *  アクションを発生させる(すべてのアクション配列をサーチする)
 *--------------------------------------------------------------
 *  IN : 実行アドレス
 *  OUT: アクション配列が確保できたら、その配列のアドレスを
 *       確保できないときは、SMTA_Dummy_Actwkのポインタを返す
 *--------------------------------------------------------------
 */
void* SMTA_MakeAction(void *exeadd)
{
    ACTWK *iy;
    Uint16 i;

    iy = &SMTA_ActionBuf[0];
    for (i = 0; i < ACTWKMAX; i++) {
         if (iy->actid == 0) {
             iy->actid = 1;
             iy->pcbuff = exeadd;
             iy->mode = 0;
             iy->status = 0;
             iy->level = 0;
             return iy;
         }
         iy++;
     }
     return &SMTA_DummyActwk;
}




/*--------------------------------------------------------------
 *  アクションを発生させる(サーチエリア、サーチカウント指定)
 *--------------------------------------------------------------
 *  IN : 実行アドレス、サーチを開始する配列のインデックス
 *       サーチカウンタをセットする
 *  OUT: アクション配列が確保できたら、その配列のアドレスを
 *       確保できないときは、SMTA_Dummy_Actwkのポインタを返す
 *--------------------------------------------------------------
 */
void* SMTA_MakeActionX(void *exeadd, Uint8 start, Uint8 count)
{
    ACTWK *iy;
    Uint16 i;

    iy = &SMTA_ActionBuf[start];
    for (i = 0; i < count; i++) {
         if (iy->actid == 0) {
             iy->actid = 1;
             iy->pcbuff = exeadd;
             iy->mode = 0;
             iy->status = 0;
             iy->level = 0;
             return iy;
         }
         iy++;
     }
     return &SMTA_DummyActwk;
}


/*--------------------------------------------------------------
 *  アクションを発生させる(指定した配列に強制にセットする)
 *--------------------------------------------------------------
 *  IN : 実行アドレス、セットする配列のインデックス
 *  OUT: 確保した配列のアドレスを返す
 *--------------------------------------------------------------
 */
void* SMTA_SetAction(void *exeadd, Uint8 start)
{
    ACTWK *iy;
    Uint16 i;

    iy = &SMTA_ActionBuf[start];
    iy->actid = 1;
    iy->pcbuff = exeadd;
    iy->mode = 0;
    iy->status = 0;
    iy->level = 0;
    return iy;
}






/*--------------------------------------------------------------
 *  アクションを実行する
 *--------------------------------------------------------------
 *  配列の先頭からactidが０かどうか調べて０でないとき
 *   pcbuffのアドレスをコールします
 *--------------------------------------------------------------
 */
void SMTA_ActionLoop(void)
{
    ACTWK *ix;

    ix = &SMTA_ActionBuf[0];

    do {
        if (ix->actid != 0) {        /* actidが０かどうか    */
            if (ix->pcbuff != NULL)  /* pcbuffがNULLかどうか */
                (ix->pcbuff)(ix);    /* pcbuff先をコールする */
        }
        ix++;
    } while (ix != &SMTA_ActionBuf[ACTWKMAX]);

}





