/*------------------------------------------------------------------------
 *  FILE:	csh_main.c
 *      $Author: $Y.K
 *      $Date: $1994-05-10
 *      $Locker: $
 *      $Revision: $0.90
 *      $Source: $
 *      $State: $
 *
 *	Copyright(c) 1994 SEGA
 *      Copyright (c) by SEGA Enterprises Ltd. 1994. All rights reserved. 
 *
 *  PURPOSE:
 *		CPU Cache Operation function program
 *
 *  DESCRIPTION:
 *
 *
 *  INTERFACE
 *
 *
 *  CAVEATS
 *
 *
 *  AUTHOR(S):
 *		Y.K
 *		
 *  MOD HISTORY:
 *      $Log: $
 * 
 * 
 *------------------------------------------------------------------------
 */
#include "sega_xpt.h"
#include "sega_csh.h"

/****************************************************************************/
/*	高水準関数																*/
/****************************************************************************/

/****************************************************************************/
/*	キャッシュの初期化														*/
/****************************************************************************/
void CSH_Init(Uint16 sw)
{
	Uint32 way;									/*	アクセスウェイ制御変数	*/
	Uint32 i;									/*	アクセスライン制御変数	*/
	Uint32 *adrs;								/*	ｱﾄﾞﾚｽｱﾚｲ領域先頭ｱﾄﾞﾚｽ	*/
	
	CSH_SET_ENABLE(CSH_DISABLE);				/*	キャッシュディセーブル	*/
	for (way = 0; way < 4; way++) {				/*	４ウェイループ			*/
		CSH_SET_ACS_WAY(way);					/*	アクセスウェイ指定		*/
		adrs = (Uint32 *)0x60000000;			/*	ｱﾄﾞﾚｽｱﾚｲ領域先頭ｱﾄﾞﾚｽ	*/
		for (i = 0; i < 64; i++) {				/*	64ラインループ			*/
			*adrs = 0;							/*	１ラインの情報クリア	*/
			adrs += 4;							/*	次のラインに進む		*/
		}										/*	end for i				*/
	}											/*	end for way				*/
	CSH_SET_WAY_MODE(sw);						/*	ウェイモード設定		*/
	CSH_SET_CODE_FILL(CSH_CODE_ENABLE);			/*	コードフィルイネーブル	*/
	CSH_SET_DATA_FILL(CSH_DATA_ENABLE);			/*	データフィルイネーブル	*/
	CSH_SET_ENABLE(CSH_ENABLE);					/*	キャッシュイネーブル	*/
}

/****************************************************************************/
/*	キャッシュの全クリア													*/
/****************************************************************************/
void CSH_AllClr(void)
{
	Uint32 way;									/*	アクセスウェイ制御変数	*/
	Uint32 i;									/*	アクセスライン制御変数	*/
	Uint32 *adrs;								/*	ｱﾄﾞﾚｽｱﾚｲ領域先頭ｱﾄﾞﾚｽ	*/
	
	CSH_SET_ENABLE(CSH_DISABLE);				/*	キャッシュディセーブル	*/
	for (way = 0; way < 4; way++) {				/*	４ウェイループ			*/
		CSH_SET_ACS_WAY(way);					/*	アクセスウェイ指定		*/
		adrs = (Uint32 *)0x60000000;			/*	ｱﾄﾞﾚｽｱﾚｲ領域先頭ｱﾄﾞﾚｽ	*/
		for (i = 0; i < 64; i++) {				/*	64ラインループ			*/
			*adrs = 0;							/*	１ラインの情報クリア	*/
			adrs += 4;							/*	次のラインに進む		*/
		}										/*	end for i				*/
	}											/*	end for way				*/
	CSH_SET_ENABLE(CSH_ENABLE);					/*	キャッシュイネーブル	*/
}

/****************************************************************************/
/*	対象領域の連想パージ													*/
/****************************************************************************/
void CSH_Purge(void *adrs, Uint32 P_size)
{
	void *ea;									/*	終了アドレス			*/

	adrs = (void *)((Uint32)adrs
	 & 0x1ffffff0 | 0x40000000);				/*	先頭ｲﾝﾊﾞﾘﾃﾞｰﾄｱﾄﾞﾚｽ作成	*/
	ea = (void *)((Uint32)adrs + P_size);		/*	終了アドレス＋１算出	*/
	while ((Uint32)adrs < (Uint32)ea) {			/*	対象ライン分繰り返す	*/
		*(Uint32 *)adrs = 0;					/*	インバリデート			*/
		adrs = (void *)((Uint32)adrs + 16);		/*	次の準備				*/
	}											/*	end	while				*/
}

/****************************************************************************/
/*	End of File																*/
/****************************************************************************/
